blog-posts/2004-12-08-demo-tomorrow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Demo tomorrow</title>
<!-- 2014-04-30 Wed 17:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Demo tomorrow</h1>
<p>
December 8th, 2004 -
<a href="http://sachachua.com/blog/p/2475"><a href="http://sachachua.com/blog/p/2475">http://sachachua.com/blog/p/2475</a></a>
</p>

<p>
Objective: Give Prof. Chignell some ideas about Planner so that he can
 introduce me to the wearable computing and personal information
 management research groups.
</p>

<p>
I don't have to convince him to let me do this kind of research for my
 master's. I could use more time to bring out and document different
 usage patterns, anyway. I do want to show him that I care about users
 and I'm good at tweaking things for particular needs, though.
</p>

<p>
Medical handhelds seem very interesting. I don't have to take personal
 information management up for my master's as long as I make sure I
 talk to the people in that group and learn how they do research.
 Medical handhelds would be far more useful to people in the
 Philippines. I should get in touch with Doc Oly as well as the UP
 Manila folks.
</p>

<p>
What points can I highlight that will transfer well to that field?
</p>

<ul class="org-ul">
<li>Different requirements: interface, functionality.
</li>

<li>Minimizing attention required: context switch, distraction,
</li>
</ul>

<blockquote>
<p>
automatic context.
</p>
</blockquote>

<ul class="org-ul">
<li>Evolving functionality based on user feedback. Quick development.
</li>
</ul>

<blockquote>
<p>
User-contributed code.
</p>
</blockquote>

<p>
‘course, I'll have to rewrite my
<a href="http://sachachua.com/notebook/wiki/StatementOfPurpose">StatementOfPurpose</a>
at some point.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
